# Задайте последовательность чисел. Напишите программу, которая выведет
# список неповторяющихся элементов исходной последовательности.

sequence = set(input('Введите последовательность чисел - ').split())
print('Список неповторяющихся элементов', sequence)
