# Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.

s = input('введите буквы: ')
s1 = input('введите буквы: ')
print(s.count(s1))
